framework/storage/xml/cove/consultacove.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.ventanillaunica.gob.mx/cove/ws/oxml/" xmlns:ns2="http://www.ventanillaunica.gob.mx/ConsultarEdocument/">
	<soapenv:Header>
		<wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:UsernameToken> 
				<wsse:Username/> 
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"/>
			</wsse:UsernameToken> 
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body> 
		<ns2:ConsultarEdocumentRequest>
	    	<ns2:request>
			    <ns2:firmaElectronica> 
					<ns1:certificado/>
					<ns1:cadenaOriginal/>
					<ns1:firma/>
				</ns2:firmaElectronica>
				<ns2:criterioBusqueda>
	     			<ns2:eDocument/>
	     			<ns2:numeroAdenda/>
	     		</ns2:criterioBusqueda>
	     	</ns2:request>
	    </ns2:ConsultarEdocumentRequest>
	</soapenv:Body>
</soapenv:Envelope>